title: Cscript Visual Basic Script Execution
id: SEC-20220511356
status: experimental
description: Adversaries may abuse Visual Basic (VB) for execution
author: frack113
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.005/T1059.005.md
date: 2022/01/02
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \cscript.exe
        CommandLine|contains: '.vbs'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.execution
    - attack.t1059.005