title: Suspicious using of softperfect network scanner tool
id: SEC-20220911001
author: CyberCave
date: 2022/09/11
modified: 2022/09/11
status: experimental
description: attacker can abuse legitemnt tool like softperfect network scanner to avoid detection in network
tags:
  - attack.discovery
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Description: '*Application for scanning networks*'
        Company: '*SoftPerfect Pty Ltd*'
        Product: '*Network Scanner*'
    condition: selection
falsepositives:
    - Legitimate use by administrators
level: Medium