DeviceProcessEvents | where ((FolderPath contains "cmd.exe") and ProcessCommandLine contains @"REG add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v DisableTaskMgr /t REG_DWORD /d 1 /fac")