title: Suspicious Execution of Systeminfo
id: SEC-20220512243
status: experimental
description: Use of systeminfo to get information
author: frack113
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1082/T1082.md#atomic-test-1---system-information-discovery
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/systeminfo
date: 2022/01/01
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \systeminfo.exe
    condition: selection
falsepositives:
    - Unknown
level: low
tags:
    - attack.discovery
    - attack.t1082